#คำนวณหาค่าเฉลี่ยของคะแนนจากการสอบ 3 ครั้ง 
#โดยรับค่า รหัส นักเรียน ชื่อนักเรียน และคะแนนสอบแต่ละครั้งรวม 3 ครั้งทางแป้นพิมพ์ แล้วแสดงผลค่าเฉลี่ยที่คำนวณได้ทาง หน้าจอ
#ขอ 3 ฟังก์ชั่น ดังนั้นต้องหาให้ได้ 3 feture

def AA():
    ID = input("รหัส :")
    name = input("ชื่อนักเรียน :")
    A = int(input("สอบครั้งที่ 1 :"))
    B = int(input("สอบครั้งที่ 2 :"))
    C = int(input("สอบครั้งที่ 3 :"))
    return A, B, C

def BB(A,B,C):
    S = A+B+C / 3
    return S


def CC(S):
    print(f'ค่าเฉลี่ยสอบสามครั้ง = {S}')

print("+++++++++++++++++++++++++++++")
print("+++ ค่าเฉลี่ยคะเเนนสอบ 3 ครั้ง +++")
print("+++++++++++++++++++++++++++++")
A,B,C =AA()
print("+++++++++++++++++++++++++++++")
S = BB(A,B,C)
CC(S)
print("+++++++++++++++++++++++++++++")



