#คำนวนราคาขายสสินค้า โดยรับชื่อสินค้า เเละราคาสินค้า(ต้นทุน) ทางเเป้นพิมพ์ เเล้วคำนวนหาราคาขายของสินค้า 
#โดยราคาขายสินค้าจะคิดเพิ่มจากราคาสินค้า (ต้นทุน) ร้อยละ 10 สูตร ราคาสินค้า = ราคาสินค้า(ต้นทุน)+ราคาสินค้า(ต้นทุน)*10/100
#ขอ 3 ฟังก์ชั่น ดังนั้นต้องหาให้ได้ 3 feture

def A():
    PP = input("ชื่อสินค้า : ")
    CP= float(input("ราคาสินค้า(ต้นทุน) : "))
    return PP, CP

def B(CP):
    SP = CP + (CP * 10 / 100)
    return SP

def C(PP, CP, SP):
    print(f"ชื่อสินค้า :{PP} ")
    print(f"ราคาสินค้า(ต้นทุน) :{CP:.2f} บาท")
    print(f"ราคาขายของสินค้า :{SP:.2f} บาท")

print("=================================")
print("========= ราคาขายสินค้า ===========")
print("=================================")
PP, CP = A()
SP = B(CP)
print("=================================")
C(PP, CP, SP)
print("=================================")
