#คำนวนหาเงินเดือนสุทธิของพนักงาน แล้วแสดงผลทางหน้าจอ โดยรับค่ารหัส พนักงาน ซื้อพนักงาน และเงินเดือนปกติของพนักงานทางแป้นพิมพ์
#ทั้งนี้เงินเดือนสุทธิของพนักงานนั้นจะต้องหัก ค่าภาษี และเบี้ยประกันสังคมออกจากเงินเดือนปกติเสียก่อน โดยที่พนักงานต้องเสียภาษี 7% ของเงินเดือนปกติ และจ่ายค่าเบี้ยประกันสังคม 500 บาท
#สูตร เงินเดือนสุทธิ =เงินเดือนปกติ- (เงินเดือนปกติ : 7/100) - 500
#ขอ 3 ฟังก์ชั่น ดังนั้นต้องหาให้ได้ 3 feture

def A():
    ID = input("ป้อนรหัสพนักงาน: ")
    NAME = input("ป้อนชื่อพนักงาน: ")
    ML = float(input("ป้อนเงินเดือนปกติของพนักงาน: "))
    return ID, NAME, ML

def B(ML):
    PC = 7  
    TAX = (ML * PC) / 100
    return TAX

def C():
    SSF = 500
    return SSF

def D(ML, TAX, SSF):
    NS = ML - TAX - SSF
    return NS

def E(ID, NAME, ML, TAX, SSF, NS):
    print(f"ป้อนรหัสพนักงาน : {ID}")
    print(f"ป้อนชื่อพนักงาน : {NAME}")
    print(f"ป้อนเงินเดือนปกติ : {ML:.2f} บาท")
    print(f"ภาษีเป็นเงิน : {TAX:.2f} บาท")
    print(f"ค่าเบี้ยประกันสังคม : {SSF:.2f} บาท")
    print(f"เงินเดือนสุทธิเป็นเงิน : {NS:.2f} บาท")

print("=================================")
print("====== คำนวณเงินเดือนพนักงาน =======")
print("=================================")
ID, NAME, ML = A()
print("=================================")
TAX = B(ML)
SSF = C()
NS = D(ML, TAX, SSF)
E(ID, NAME, ML, TAX, SSF, NS)
print("=================================")
    