#แก้สมการ y = 2x + 2x + 1 เมื่อ x คือค่าที่รับทางแป้นพิมพ์ และ แสดงผลจากการแก้สมการ y ที่ใต้ทางหน้าจอ
#Feature ในการรับค่า การคำนวณ เเละการเเสดงผลเเยกจากกัน
#ขอ 3 ฟังก์ชั่น ดังนั้นต้องหาให้ได้ 3 feture

def AA():
    x = float(input("กรุณากรอกค่า x: "))
    return x

def BB(x):
    y = 2 * x + 2 * x + 1
    return y

def CC(x, y):
    print(f"เมื่อ x = {x}, ผลลัพธ์ของ y คือ {y}")

print("+++++++++++++++++++++++")
print("+++++ แก้ สมการ Y +++++")
print("+++++++++++++++++++++++")
x = AA()
y = BB(x)
print("+++++++++++++++++++++++")
CC(x, y)
print("+++++++++++++++++++++++")
